app/controllers/choices_controller.rb

SELECT "choices".* FROM "choices"
---
 def index
    @choices = Choice.all

SELECT  "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @choice = Choice.find(params[:id])