app/controllers/policies_controller.rb

  def index
    @policies = Policy.all
---
SELECT "policies".* FROM "policies"

  def create
    @policy = Policy.new(policy_params)

    respond_to do |format|
      if @policy.save
---
INSERT INTO "policies" ("name", "left", "right", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Fiscal Policy"], ["left", "Left Value"], ["right", "Right Value"], ["created_at", 2016-08-09 16:20:01 UTC], ["updated_at", 2016-08-09 16:20:01 UTC]]

  def update
    respond_to do |format|
      if @policy.update(policy_params)
---
UPDATE "policies" SET "left" = $1, "right" = $2, "updated_at" = $3 WHERE "policies"."id" = $4  [["left", "Left"], ["right", "Right"], ["updated_at", 2016-08-09 16:29:03 UTC], ["id", 3]]

  def destroy
    @policy.destroy
---
DELETE FROM "policies" WHERE "policies"."id" = $1  [["id", 2]]

    def set_policy
      @policy = Policy.find(params[:id])
---
SELECT  "policies".* FROM "policies" WHERE "policies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]