app/controllers/users_controller.rb

SELECT "policies".* FROM "policies"
---
  def show
    @user = current_user
    @choices = @user.choices
    if @choices.empty? == false
      @policies = Policy.all

INSERT INTO "users" ("first_name", "last_name", "location", "party", "email", "profile_pic", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "123412341234qwer"], ["updated_at", 2016-08-09 17:04:09 UTC], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    @user.update_attributes(user_params)